keywords_meaning = ["成長",
"安全",
"獲利",
"經營",
"價格"]

keywords = ["成長 發展 滋長 長大 蓬勃 增大 增長 擴展 追高 營收成長率 淨利成長率 營運現金流量 成長率",
"安全 安定 平穩 安穩 長期 負債比率 長期資金",
"獲利 盈利 賺錢 收益 資產報酬率 股東權益報酬率 股利高",
"經營 周轉 現金 資產周轉率 應收帳款周轉率",
"價格 低估 投資 本益比 每股營收 股價營收 便宜"]



idx2pihua = [
    ["你想要的是有成長力的股票，對吧？",
     "根據我的分析，你想要的股票，公司要具有發展力的特點。"],

    ["你想要的應該是安全並且穩定的股票",
     "我覺得你想要的應該是比較穩定，可以長期持有的股票"],

    ["我覺得你要的應該是獲利能力良好企業的股票",
     "我覺得可以從每一年盈利高的公司來推薦"],

    ["應該是經營能力好的公司比較符合你的要求..."
     "現金足夠、周轉足夠應該比較符合你的想法吧。"],

    ["我覺得股價目前比較好，這個時候可以入手的股票適合你。",
     "從你的描述看，股價被低估、價格低的股票比較好。"]
    ]